etc/OpenFOAM_Sample_Files/indoor_airflow_temperature/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.3 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		T;
}

dimensions		[0 0 0 1 0 0 0];

internalField		uniform 300;

boundaryField
{

    boundingbox
    {

        type		zeroGradient;

    }

    room
    {

        type		fixedValue;

        value		uniform 291.15;

    }

    roof
    {

        type		fixedValue;

        value		uniform 373.15;

    }

}