etc/OpenFOAM_Sample_Files/indoor_airflow_temperature/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.3 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		volScalarField;
	location	"0";
	object		alphat;
}

dimensions		[0 2 -1 0 0 0 0];

internalField		uniform 0;

boundaryField
{

    boundingbox
    {

        type		zeroGradient;

    }

    room
    {

        type		alphatJayatillekeWallFunction;

        value		uniform 0;

        Prt		0.85;

    }

    roof
    {

        type		alphatJayatillekeWallFunction;

        value		uniform 0;

        Prt		0.85;

    }

}