etc/OpenFOAM_Sample_Files/indoor_airflow_temperature/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.3 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		blockMeshDict;
}

convertToMeters 1.0000;

vertices
(
	(1.0 1.0 0.0)
	(9.0 1.0 0.0)
	(9.0 9.000000000000002 0.0)
	(1.0 9.000000000000002 0.0)
	(1.0 1.0 9.0)
	(9.0 1.0 9.0)
	(9.0 9.000000000000002 9.0)
	(1.0 9.000000000000002 9.0)
);

blocks
(
hex (0 1 2 3 4 5 6 7) (8 8 9) 
simpleGrading (
	1.0
	1.0
	1.0
	)
);

edges
(
);

boundary
(   boundingbox
   {
       type wall;
       faces
       (       
	(0 3 2 1)
	(4 5 6 7)
	(0 1 5 4)
	(1 2 6 5)
	(2 3 7 6)
	(3 0 4 7)
       );
   }
);

mergePatchPair
(
);
