etc/OpenFOAM_Sample_Files/indoor_airflow_temperature/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
/*Generated by Butterfly 0.0.3 https://github.com/mostaphaRoudsari/Butterfly *\
\*---------------------------------------------------------------------------*/
FoamFile
{
	version		3.0;
	format		ascii;
	class		dictionary;
	location	"system";
	object		fvSchemes;
}

ddtSchemes
{

    default		steadyState;

}

gradSchemes
{

    default		cellLimited leastSquares 1;

}

divSchemes
{

    default		none;

    div(phi,epsilon)		bounded Gauss linearUpwind grad(epsilon);

    div(phi,T)		bounded Gauss linearUpwind default;

    div(phi,U)		bounded Gauss linearUpwindV grad(U);

    div((nuEff*dev2(T(grad(U)))))		Gauss linear;

    div(phi,k)		bounded Gauss linearUpwind grad(k);

}

laplacianSchemes
{

    default		Gauss linear limited corrected 0.333;

}

interpolationSchemes
{

    default		linear;

}

snGradSchemes
{

    default		limited corrected 0.333;

}

fluxRequired
{

    default		no;

}